/**  
 * Copyright © 2018公司名字. All rights reserved.
 * @Title: KeyWordC.java
 * @Prject: SiteMonitor
 * @Package: com.hnjing.utils.httpclient
 * @Description: TODO
 * @author: Jinlong He
 * @mail: hejinlong01@hnjing.com
 * @date: 2018年12月15日 下午4:11:43
 * @version: V1.0  
 */
package com.hnjing.utils.httpclient;

import java.util.regex.Matcher;
import java.util.regex.Pattern;

/**
 * @ClassName: KeyWordC
 * @Description: TODO
 * @author: Jinlong He
 * @date: 2018年12月15日 下午4:11:43
 */
public class KeyWordC {
	
	static String[] ke = {"国家级", "世界级", "最高级", "最佳", "最大", "第一", "唯一", "首个", "首选", "最好", "最大", "精确", "顶级", "最高", "最低", "最", "最具", 
		"最便宜", "最新", "最先进", "最大程度", "最新技术", "最先进科学", "国家级产品", "填补国内空白", "绝对", "独家", "首家", "最新", "最先进", 
		"第一品牌", "金牌", "名牌", "优秀", "最先", "顶级", "独家", "全网销量第一", "全球首发", "全国首家", "全网首发", "世界领先", "顶级工艺", 
		"最新科学", "最新技术", "最先进加工工艺", "最时尚", "极品", "顶级", "顶尖", "终极", "最受欢迎", "王牌", "销量冠军", "第一", "NO.1", "Top1", 
		"极致", "永久", "王牌", "掌门人", "领袖品牌", "独一无二", "独家", "绝无仅有", "前无古人", "史无前例", "万能", "惊现", "惊爆", "竟然", "竟", 
		"胆敢", "最好", "最佳", "金牌", "名牌", "优秀", "资深", "最佳", "最赚", "超赚", "第一", "唯一", "最新", "最高", "最先", "巨星", "著名", 
		"第一品牌", "奢侈", "至尊", "顶级享受", "最好", "资深教师", "名牌", "优秀教师", "影帝", "巨星", "天王", "天见效", "全面升级", 
		"迅速修复受紫外线伤害的肌肤", "巅峰", "中国驰名商标", "仅限", "大牌", "领袖", "之王", "100%", "纯天然", "老字号", "特供", "秒杀", 
		"马上降价", "最", "最佳", "最具", "最爱", "最赚", "最优", "最优秀", "最好", "最大", "最大程度", "最高", "最高级", "最高档", 
		"最奢侈", "最低", "最低级", "最低价", "最底", "最便宜", "时尚最低价", "最流行", "最受欢迎", "最时尚", "最聚拢", "最符合", 
		"最舒适", "最先", "最先进", "最先进科学", "最先进加工工艺", "最先享受", "最后", "最后一波", "最新", "最新科技", "最新科学", 
		"首个", "首选", "独家", "独家配方", "全国首发", "首款", "全国销量冠军", "国家级产品", "国家国家免检", "国家领导人", "填补国内空白", 
		"中国驰名", "驰名商标", "国际品质", "史无前例", "前无古人", "永久", "万能", "祖传", "特效", "无敌", "纯天然", "100%", "王牌", 
		"领袖品牌", "世界领先", "遥遥领先", "领导者", "缔造者", "创领品牌", "领先上市", "巨星", "著名", "掌门人", "至尊", "巅峰", "奢侈", 
		"优秀", "资深", "领袖", "之王", "王者", "冠军", "史无前例", "前无古人", "永久", "万能", "祖传", "特效", "无敌", "纯天然", "100%", 
		"高档", "正品", "真皮", "超赚", "精准", "大牌", "金牌", "名牌", "王牌", "领袖品牌", "世界领先", "遥遥领先", "领导者", "缔造者", 
		"创领品牌", "领先上市", "巨星", "著名", "掌门人", "至尊", "巅峰", "奢侈", "优秀", "资深", "领袖", "之王", "王者", "冠军", "第一", 
		"中国第一", "全网第一", "销量第一", "排名第一", "唯一", "第一品牌", "NO.1", "TOP.1", "独一无二", "全国第一", "一流", "一天", 
		"仅此一次一款", "最后一波", "全国X大品牌之一", "国家级相关单位颁发的除外", "国家级产品", "全球级", "宇宙级", "世界级", 
		"顶级顶尖/尖端", "顶级工艺", "顶级享受", "极品", "极佳", "绝佳", "绝对", "终极", "极致", "点击领奖", "恭喜获奖", 
		"全民免单", "点击有惊喜", "点击获取", "点击转身", "点击试穿", "点击翻转", "领取奖品涉嫌诱导消费者秒杀", "抢爆", 
		"再不抢就没了", "不会更便宜了", "错过就没机会了", "万人疯抢", "全民疯抢", "抢购", "卖疯了", "抢疯了", "老字号", 
		"中国驰名商标", "特供", "专供", "专家推荐", "质量免检", "无需国家质量检测", "免抽检", "领导人推荐", "机关推荐"};

	/** 
	* @Title: main 
	* @Description: 
	* @param args  
	* void    返回类型 
	* @throws 
	*/
	public static void main(String[] args) {
		
		String a = "国家权威领导人推荐长沙好习惯机器人_长沙机器人教育/培训/考级/竞赛_长沙乐高机器人 --> 0731-84512170 首页 走进好习惯 新闻动态 机构展示 课程体系 师资介绍 乐在好习惯 游学竞赛 ———   预约试听课程  ——— 提交 4-8岁（积木课程）使用积木机器人进行教学，使得幼儿也能接受机器人的启蒙教育 8-12岁（单片机）让学员可以学会自己制作一个具备基础智能的单片机机器人 12-16岁（人形）完全diy式搭建，用机器人模块制作多种形态的机器人 教育理念秉承“玩中学，做中学”的教育理念，结合“pdca”的教学模式，通过情境导入、探索体验、反思学习、总结重构等环节，培养孩子对于机器人和编程的认知，让孩子在快乐中学习！ 精英团队国家级金牌教练员、中国青少年机器人竞赛湖南省代表队总教练领衔执教；教学经验丰富，专业背景强，所有老师均有教育、心理、理工科背景，全心全意服务每一位孩子和家长！ 免费试听价值200元的免费试听体验资格，现场设计并制作机器人，名额有限；全国200余家分校，就近试听，保证您和孩子有一个奇妙的“科学之旅”！ 竞赛升学在国家重视科技进步和机器人产业发展的背景下，各大名校均开设机器人竞赛队，在小升初、初升高、高考自招考试中招收有机器人竞赛获奖背景的优秀学生，参加相应考试就有机会圆梦名校。 好习惯机器人是湖南省第一家专业校外机器人培训机构，专业从事长沙乐高机器人、长沙机器人教育、长沙机器人培训、长沙机器人竞赛、长沙机器人考级、长沙steam教育、长沙创客教育、长沙少儿编程、长沙乐博乐博机器人培训服务，服务于湖南长沙、株洲、益阳、衡阳、娄底、怀化、邵阳等地。九年来机器人竞赛成绩斐然：五次夺得湖南省青少年机器人竞赛第一名，代表湖南省参加中国青少年机器人竞赛，四次夺得金牌，一次夺得银牌。作为湖南省青少年科技教育协会机器人教育专业委员会及国际奥林匹克智能机器人竞赛委员会理事单位，好习惯机器人教育与50多家幼儿园及学校合作开展机器人科技教育，累计培养小学员数万人。 ← → more 新闻动态the newsmore > 机器人产业大发展，投向长沙2018-11-07畅聊长沙创客教育品牌的核心2018-11-07参加长沙机器人竞赛培训，全2018-11-03长沙好习惯机器人：机器人教2018-11-03长沙乐高机器人能以何种方式2018-11-03长沙机器人教育：机器人占据2018-11-03 赛事动态the matchmore > 2018年好习惯机器人竞赛喜报！2018-09-10 2018湖南省奥林匹克青少年智2018-07-072018年湖南省青少年机器人竞赛2018-05-26好习惯机器人2017年机器人竞赛2017-10-16好习惯机器人选手第六次省赛2017-05-22跟随irioc竞赛 来场说走就走的2017-05-11 家长关心parental caremore > q：什么是机器人教育？ a： 简单来说，机器人教育是指通过组装、搭建、运行机器人，激发学生学习兴趣、培养学生综合能力（动手能力、想象力和逻辑...q：学习机器人有什么好处？ a： 孩子在成长过程中对眼前的世界有着强烈的好奇心以及探索欲，是一个认知的阶段，通过对机器人的学习： （1）可以充分调...q：好习惯机器人的师资背景怎么样？ a： 专业性：基本都是理工科毕业的，大多数学习的是机械化专业和计算机专业，还有一部分学习的是心理学专业和教育学的；...q：好习惯机器人是如何上课的？ a： 我们是小班授课，一个班6-8人，6个人开班，8个人满班。分班都是按年龄段来分的，同一个年龄段的在一起上课，不会出现混...q：如何成为科技特长生？ a： 孩子在我们这单片机学完两期后就可以参加各级竞赛，获得优秀成绩的取得科技特长生考试资格的，可以在好习惯机器人学校...q：孩子学到什么水平可以参赛？ a： 每一位小朋友都有参加比赛的机会，但是针对不同年龄段以及孩子学习的程度不一样参赛的项目也会有所不同。... 教师风采 展示视频 乐博乐博海外游学项目视 乐博乐博为了打造世界一流的游学服务平台，先后与韩国、美国、加拿大等国家展开合作，给学员更多的优质竞赛出口 第12届乐博杯国际机器人竞 乐博杯是由北京乐博乐博教育科技有限公司主办，每年2次，迄今为止已经成功举办了12届！ 乐博乐博机器人器材展示 乐博乐博机器人根据不同年龄阶段总共分为三种类型：积木机器人-单片机机器人-人形机器人 乐博乐博新课程体系-uar 乐博乐博机器人课程再度升级，uaro编码机器人来中国啦！ dash-达奇机器人，轻松快乐 美商奇幻工房的主打产品-dash（达奇机器人）加入到乐博乐博大家庭当中，在玩耍中学习编程，让达奇成为孩子生活中的 more more 友情链接：乐博乐博机器人官网 机器人培训 襄阳乐博乐博机器人 青少年机器人教育网 课程体系 课程优势 积木课程 单片机课程 机器人创客 相关视频 走进好习惯 企业概况 企业文化 发展历史 知识产权 联系我们 官方微信 新闻动态 最新消息 少儿编程 教育理念 行业动态 乐在好习惯 家长关心 明星学员 荣誉展示 最近活动 长沙好习惯机器人培训学校,长沙机器人教育/培训/考级/竞赛品牌机构,长沙乐高机器人课程多少钱 机器人培训 校区分布 师资保障 联系我们 网站地图 copyright © 2008-2017 好习惯机器人教育 版权所有 湘icp备15013356号-1";
		for(String k : ke) {
			Pattern p = Pattern.compile(k); //比如：http://www.zifangsky.cn
	        Matcher m = p.matcher(a);
	        if (m.find()) {	      
	        	System.out.println(m.regionStart()+"-"+m.regionEnd());
	        	int startF =  m.end()-k.length();
	        	int endF = m.end();
	        	System.out.println(startF+" - "+endF);
	        	System.out.println(a.substring(startF, endF));
	        	
	        	int f = startF;
	        	if(f<=5) {
	        		f=0;
	        	}else {
	        		f = f-5;
	        	}
	        	int e = endF;
	        	if(e<a.length()-5) {
	        		e = e+5;
	        	}else {
	        		e = a.length();
	        	}
	        	System.out.println(a.substring(f, e));
	            System.out.println(k +": "+m.groupCount());
	        }
	        
		}
		 System.out.println("检测完成");
		
		
	}

}
